import { useEffect, useRef, useState } from "react";
import { createLrcObj, LrcObj } from "react-lrcplayer";
import style from './index.module.scss'
import { uuid } from "@/src/plug";
import { useGSAP } from "@gsap/react";
import gsap from "gsap";
gsap.registerPlugin(useGSAP);

const baseLrc = createLrcObj(`[00:10:39]船_0_摇_111_啊_145_摇_181_
[00:12:51]摇_0_到_81_陌_114_生_161_的_179_远_226_方_244_摇_277_断_310_了_325_船_343_桨_372_
[00:16:37]进_0_土_71_壤_103_长_175_成_205_了_237_愿_282_望_300_和_347_新_363_故_393_乡_425_
[00:20:95]我_0_的_165_朋_196_友_227_
[00:22:91]你_0_在_128_哪_162_是_206_否_220_凝_268_望_283_同_317_一_351_轮_367_月_386_光_416_
[00:26:81]有_0_没_114_有_145_成_209_为_242_期_277_待_321_的_336_英_388_雄_403_模_436_样_470_
[00:31:00]Nzuri_0_Sana_38_
[00:41:81]风_0_绕_149_啊_181_绕_214_
[00:43:84]绕_0_成_114_年_146_轮_196_记_210_录_254_西_271_山_302_来_336_的_352_歌_368_谣_399_
[00:47:69]轻_0_唱_100_着_132_十_200_八_231_万_264_个_311_寂_327_静_371_的_387_夜_421_色_454_
[00:52:27]我_0_的_92_朋_123_友_156_
[00:54:21]若_0_岁_53_月_87_是_132_一_148_条_195_能_212_够_248_逆_282_流_314_的_331_河_352_
[00:58:16]你_0_是_50_否_77_还_145_会_176_踏_209_上_255_未_271_知_318_的_335_远_367_走_399_
[01:02:67]Hakunamatata_0_my_198_friend_229_
[01:05:25]绽_0_放_58_吧_74_异_96_世_124_界_140_的_157_花_188_蕾_222_
[01:07:89]Hakunamatata_0_my_220_friend_252_
[01:10:51]命_0_运_84_的_101_恩_119_惠_143_从_174_未_197_走_224_远_241_
[01:13:08]Latata_0_Latata_137_
[01:15:51]从_0_繁_69_花_86_到_114_深_129_渊_147_从_170_白_192_昼_213_到_241_夜_258_
[01:18:25]净_0_土_43_将_72_歌_93_颂_110_你_131_崇_151_高_169_的_189_灵_213_魂_235_到_264_永_285_远_351_永_416_远_492_
[01:23:45]船_0_摇_115_啊_148_摇_183_
[01:25:51]摇_0_到_85_太_118_阳_163_下_179_班_223_月_238_儿_275_挂_307_树_339_梢_374_
[01:29:42]歇_0_歇_73_脚_107_默_171_念_205_早_239_睡_293_早_308_起_355_身_370_体_402_好_433_
[01:34:03]我_0_的_74_朋_102_友_136_
[01:36:00]要_0_是_28_累_65_了_109_病_130_了_178_找_194_我_225_瞧_259_一_290_瞧_328_
[01:39:87]不_0_得_121_了_156_三_226_丘_253_丘_269_快_286_采_326_药_341_让_377_四_410_丘_436_丘_452_熬_466_
[01:44:42]Hakunamatata_0_my_55_friend_189_
[01:46:96]森_0_林_130_里_145_传_167_来_194_可_211_爱_226_回_261_响_295_
[01:49:63]Hakunamatata_0_my_193_friend_222_
[01:52:17]见_0_你_68_点_84_燃_117_勇_151_敢_172_的_204_火_220_把_249_
[01:54:87]Latata_0_Latata_219_
[01:57:21]从_0_桓_46_那_67_兰_96_那_111_到_141_欧_172_庇_195_克_223_莱_241_呀_268_
[02:00:03]地_0_脉_25_记_51_录_75_着_101_你_122_传_142_奇_164_的_189_诗_208_篇_230_到_253_永_327_远_353_永_383_远_442_
[02:15:67]船_0_摇_136_啊_170_摇_205_
[02:17:70]摇_0_到_103_陌_137_生_183_的_199_远_243_方_258_摇_291_断_324_了_340_船_363_桨_391_
[02:21:57]进_0_土_91_壤_122_长_194_成_224_了_256_愿_307_望_321_和_367_新_380_故_408_乡_434_
[02:26:06]我_0_的_82_朋_116_友_149_
[02:28:14]有_0_没_44_有_81_找_121_到_134_我_179_留_195_给_230_你_262_的_278_宝_293_藏_325_
[02:31:94]在_0_这_124_里_157_在_224_那_260_里_292_
[02:34:52]哈_0_
[02:35:31]在_0_哪_57_呢_75_
[02:37:02]别_0_找_23_了_42_一_68_起_80_唱_92_吧_108_
[02:39:14]船_0_摇_83_啊_113_摇_145_
[02:41:16]摇_0_到_47_陌_74_生_117_的_131_远_179_方_192_摇_232_断_263_了_284_船_303_桨_332_
[02:44:91]进_0_土_126_壤_160_长_220_成_257_了_295_愿_336_望_350_和_406_新_421_故_457_乡_489_
[02:49:60]我_0_的_126_朋_157_友_186_
[02:51:54]你_0_在_88_哪_121_是_163_否_179_凝_228_望_244_同_280_一_312_轮_329_月_345_光_376_
[02:55:44]有_0_没_81_有_111_成_176_为_209_期_244_待_288_的_302_英_352_雄_368_模_397_样_426_
[03:00:00]船_0_摇_63_啊_99_摇_130_摇_197_啊_228_摇_263_啊_313_摇_328_啊_359_摇_393_
[03:05:26]风_0_绕_92_啊_122_绕_155_绕_221_啊_251_绕_285_啊_339_绕_353_啊_384_绕_412_
[03:10:50]我_0_的_114_朋_143_友_176_
[03:12:36]请_0_带_72_走_107_这_153_一_167_首_201_歌_234_
[03:15:72]去_0_更_134_远_198_的_262_远_293_方_328_
[03:19:72]HakunaMatata_0_My_309_friend_341_
[03:25:46]荣_0_誉_58_骑_73_士_90_哥_105_哥_122_你_136_们_148_快_167_点_188_
[03:27:47]小_0_可_66_莉_84_我_114_来_127_啦_139_宝_176_藏_193_宝_217_藏_231_
[03:30:00]派_0_蒙_14_等_31_等_48_我_65_派_90_蒙_103_
[03:31:69]吾_0_之_81_封_97_印_123_诶_138_还_159_有_177_我_206_
`);

function transformL2Lrc(lrc: LrcObj[]) {
    return lrc.map(m => {
        // 先移除末尾可能的下划线，再按下划线拆分
        const parts = m.c.replace(/_$/, '').split('_');
        const result: {
            t: number;
            c: string;
        }[] = [];
        // 每两个元素一组（文本+数字），生成对象
        for (let i = 0; i < parts.length; i += 2) {
            // 确保有对应的数字部分才添加
            if (parts[i + 1] !== undefined) {
                result.push({
                    t: m.t + Number(parts[i + 1]) / 100, // 数字部分作为t
                    c: parts[i]              // 文本部分作为c
                });
            }
        }
        return {
            time: m.t, content: m.c, line: result
        };
    })
}


export default function LineByLinePlayer() {
    const audio = useRef(null);
    const lrc = transformL2Lrc(baseLrc);
    const [currentLine, setCurrentLine] = useState(0);
    const [currentOffset, setCurrentOffset] = useState(0);
    // const [currentTime, setCurrentTime] = useState(0);
    function onTimeUpdate() {
        const currentTime = audio.current?.currentTime || 0;
        // setCurrentTime(currentTime);
        const currentLine = lrc.findIndex(m => m.time >= currentTime) - 1;
        setCurrentLine(currentLine);

        const currentOffset = lrc[currentLine]?.line?.findIndex(f => f.t >= currentTime);
        setCurrentOffset(currentOffset);

        // requestAnimationFrame(onTimeUpdate);
    }

    useEffect(() => {
        const lrc = transformL2Lrc(baseLrc);
        // console.log(lrc);
        if (audio.current) {
            onTimeUpdate();
        }
    }, []);

    // useGSAP(() => {
    //     gsap.fromTo('.line-lrc', {
    //         x: 10,
    //         opacity: 0,
    //     }, {
    //         x: 0,
    //         opacity: 1,
    //         duration: 0.2,
    //         ease: "power1.inOut",
    //         stagger: 0.1
    //     })
    // }, [])

    return <div>
        <div className={style["lyric"]}>
            {/* <span className={style['lrc']}>{lrc[currentLine]?.line?.map(m => m.c).join('')}</span> */}
            <span className={style['line']}>
                {/* {currentOffset?.map(m => <span className="line-lrc">{m.c}</span>)} */}
                {lrc[currentLine]?.line?.map((m, i) => <span data-active={i <= currentOffset}>{m.c}</span>)}
            </span>
        </div>
        <audio
            onTimeUpdate={onTimeUpdate}
            ref={audio}
            src="https://res.arsrna.cn/audios/%E9%B9%BF%E5%96%91kana%20&%20%E5%A4%9A%E5%A4%9Apoi%20&%20Mace%20&%20%E9%99%B6%E5%85%B8%20&%20%E5%AD%99%E6%99%94%20&%20%E8%8A%B1%E7%8E%B2%20-%20%E6%8F%90%E7%93%A6%E7%89%B9%E6%B0%91%E8%B0%A3%20%E6%98%9F%E7%A9%BA%E7%89%88.mp3" controls
            className="w-full"
        />
    </div>
}